<details><summary>Digger run report at 2023-10-17 21:50:29 (UTC)</summary>
  <details><summary>Plan for <b>thiagonache/potential-goggles#talend</b></summary>
  
```terraform
[command]/home/runner/work/_temp/121afc0f-41da-4664-9fc1-bb11ccaef4b3/terraform-bin plan -out /home/runner/work/potential-goggles/potential-goggles/terraform/thiagonache-potential-goggles#talend.tfplan -lock-timeout=3m -input=false -no-color -detailed-exitcode

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.state will be created
  + resource "google_storage_bucket" "state" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US"
      + name                        = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "container.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "containerregistry.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "datastore.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "monitoring.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "pubsub.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "storage.googleapis.com"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + state_bucket = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/runner/work/potential-goggles/potential-goggles/terraform/thiagonache-potential-goggles#talend.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/potential-goggles/potential-goggles/terraform/thiagonache-potential-goggles#talend.tfplan"
::debug::Terraform exited with code 2.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_storage_bucket.state will be created%0A  + resource "google_storage_bucket" "state" {%0A      + force_destroy               = false%0A      + id                          = (known after apply)%0A      + labels                      = (known after apply)%0A      + location                    = "US"%0A      + name                        = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"%0A      + project                     = (known after apply)%0A      + public_access_prevention    = (known after apply)%0A      + self_link                   = (known after apply)%0A      + storage_class               = "STANDARD"%0A      + uniform_bucket_level_access = (known after apply)%0A      + url                         = (known after apply)%0A%0A      + versioning {%0A          + enabled = true%0A        }%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "compute.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["container.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "container.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "containerregistry.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "datastore.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "iam.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "logging.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "monitoring.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "pubsub.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "storage.googleapis.com"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + state_bucket = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"%0A%0A─────────────────────────────────────────────────────────────────────────────
  ```
</details>
</details>